package com.ruptech.firefighting.http;


import com.ruptech.firefighting.model.User;

import org.json.JSONArray;
import org.json.JSONObject;

import java.util.ArrayList;
import java.util.HashMap;
import java.util.List;
import java.util.Map;

public class HttpServer extends HttpConnection {
    private static final String API_TODO_TASK_LIST = "TaskList_todo.aspx";
    private final String TAG = HttpServer.class.getSimpleName();
    private String API_LOGIN = "user_login.php";

    // Low-level interface

    public User userLogin(String username, String password)
            throws Exception {
        Map<String, String> params = new HashMap<String, String>();
        params.put("username", username);
        params.put("password", password);

        Response res = _get(API_LOGIN, params);
        JSONObject result = res.asJSONObject();

        if (result.getBoolean("success")) {
            JSONObject data = result.getJSONObject("data");

            User user = new User(data);

            return user;
        } else {
            throw new RuntimeException(result.getString("message"));
        }
    }

    protected Response _get(String ifPage, Map<String, String> params) {
        Response response = null;
        if (API_LOGIN.equals(ifPage)) {
            String body = "{ \"success\": true, \"message\": \"\", \"data\": { \"编号\": \"1\", \"用户名\": \"admin\", \"密码\": \"111111\", \"中心编号\": \"35020301\", \"真实姓名\": \"admin\", \"性别\": \"男\", \"移动电话\": \"34\", \"固定电话\": \"34\", \"邮箱\": \"3434\", \"角色编号\": \"1\", \"人员类型\": \"1\", \"人员状态\": \"1\", \"IsDel\": \"False\" } }";
            response = new Response(body);
        } else if (API_TODO_TASK_LIST.equals(ifPage)) {
            String body = "{\n" +
                    "    \"success\": true,\n" +
                    "    \"message\": \"\",\n" +
                    "    \"data\": {\n" +
                    "        \"maintain\": [\n" +
                    "            {\n" +
                    "                \"ID\": \"8\",\n" +
                    "                \"标题\": \"沈阳消防研究所\",\n" +
                    "                \"任务状态\": \"1\",\n" +
                    "                \"所属中心ID\": \"35020301\",\n" +
                    "                \"当前负责人ID\": \"1\",\n" +
                    "                \"单位ID\": \"3502030001\",\n" +
                    "                \"单位联系人\": \"123(专职消防管理人)\",\n" +
                    "                \"单位联系人电话\": \"\",\n" +
                    "                \"派单时间\": \"2011/1/21 10:09:42\",\n" +
                    "                \"提交审核时间\": \"\",\n" +
                    "                \"故障现象\": \"\",\n" +
                    "                \"故障原因\": \"\",\n" +
                    "                \"维修措施\": \"\",\n" +
                    "                \"维修总工时\": \"\",\n" +
                    "                \"审核时间\": \"\",\n" +
                    "                \"审核人ID\": \"\",\n" +
                    "                \"审核结果\": \"\",\n" +
                    "                \"不合格原因\": \"\",\n" +
                    "                \"结束时间\": \"\",\n" +
                    "                \"派单人ID\": \"1\"\n" +
                    "            },\n" +
                    "            {\n" +
                    "                \"ID\": \"9\",\n" +
                    "                \"标题\": \"沈阳消防研究所\",\n" +
                    "                \"任务状态\": \"1\",\n" +
                    "                \"所属中心ID\": \"35020301\",\n" +
                    "                \"当前负责人ID\": \"1\",\n" +
                    "                \"单位ID\": \"3502030001\",\n" +
                    "                \"单位联系人\": \"123(专职消防管理人)\",\n" +
                    "                \"单位联系人电话\": \"\",\n" +
                    "                \"派单时间\": \"2011/1/21 10:09:42\",\n" +
                    "                \"提交审核时间\": \"\",\n" +
                    "                \"故障现象\": \"建筑消防设施部件运行状态:000000001001001-故障 -------------------------------------建筑消防设施部件运行状态:000000001001001-故障 -------------------------------------建筑消防设施部件运行状态:000000001001001-故障 -------------------------------------建筑消防设施部件运行状态:000000001001001-故障\",\n" +
                    "                \"故障原因\": \"\",\n" +
                    "                \"维修措施\": \"\",\n" +
                    "                \"维修总工时\": \"\",\n" +
                    "                \"审核时间\": \"\",\n" +
                    "                \"审核人ID\": \"\",\n" +
                    "                \"审核结果\": \"\",\n" +
                    "                \"不合格原因\": \"\",\n" +
                    "                \"结束时间\": \"\",\n" +
                    "                \"派单人ID\": \"1\"\n" +
                    "            },\n" +
                    "            {\n" +
                    "                \"ID\": \"11\",\n" +
                    "                \"标题\": \"沈阳消防研究所维修\",\n" +
                    "                \"任务状态\": \"1\",\n" +
                    "                \"所属中心ID\": \"35020301\",\n" +
                    "                \"当前负责人ID\": \"1\",\n" +
                    "                \"单位ID\": \"3502030001\",\n" +
                    "                \"单位联系人\": \"123(专职消防管理人)\",\n" +
                    "                \"单位联系人电话\": \"\",\n" +
                    "                \"派单时间\": \"2011/8/26 11:25:56\",\n" +
                    "                \"提交审核时间\": \"\",\n" +
                    "                \"故障现象\": \"建筑消防设施部件运行状态:001000002001015-故障\",\n" +
                    "                \"故障原因\": \"\",\n" +
                    "                \"维修措施\": \"\",\n" +
                    "                \"维修总工时\": \"\",\n" +
                    "                \"审核时间\": \"\",\n" +
                    "                \"审核人ID\": \"\",\n" +
                    "                \"审核结果\": \"\",\n" +
                    "                \"不合格原因\": \"\",\n" +
                    "                \"结束时间\": \"\",\n" +
                    "                \"派单人ID\": \"1\"\n" +
                    "            },\n" +
                    "            {\n" +
                    "                \"ID\": \"6\",\n" +
                    "                \"标题\": \"沈阳牡丹国际大酒店有限公司牡丹酒店\",\n" +
                    "                \"任务状态\": \"1\",\n" +
                    "                \"所属中心ID\": \"35020301\",\n" +
                    "                \"当前负责人ID\": \"1\",\n" +
                    "                \"单位ID\": \"3502030006\",\n" +
                    "                \"单位联系人\": \"黎继省(消防安全管理人)\",\n" +
                    "                \"单位联系人电话\": \"\",\n" +
                    "                \"派单时间\": \"2010/11/25 11:22:45\",\n" +
                    "                \"提交审核时间\": \"\",\n" +
                    "                \"故障现象\": \"建筑消防设施部件运行状态:000000001031000-故障 -------------------------------------建筑消防设施部件运行状态:000000001031000-故障 -------------------------------------\",\n" +
                    "                \"故障原因\": \"\",\n" +
                    "                \"维修措施\": \"\",\n" +
                    "                \"维修总工时\": \"\",\n" +
                    "                \"审核时间\": \"\",\n" +
                    "                \"审核人ID\": \"\",\n" +
                    "                \"审核结果\": \"\",\n" +
                    "                \"不合格原因\": \"\",\n" +
                    "                \"结束时间\": \"\",\n" +
                    "                \"派单人ID\": \"1\"\n" +
                    "            }\n" +
                    "        ],\n" +
                    "        \"check\": [\n" +
                    "            {\n" +
                    "                \"CId\": \"2\",\n" +
                    "                \"单位计划编号\": \"5\",\n" +
                    "                \"合同编号\": \"131\",\n" +
                    "                \"中心编号\": \"35020301\",\n" +
                    "                \"单位编号\": \"3502030001\",\n" +
                    "                \"派单时间\": \"2010/11/24 16:37:49\",\n" +
                    "                \"预定时间\": \"\",\n" +
                    "                \"开始时间\": \"\",\n" +
                    "                \"意见\": \"\",\n" +
                    "                \"单位名称\": \"沈阳消防研究所\",\n" +
                    "                \"中心名称\": \"沈北新区监控中心\",\n" +
                    "                \"检查单状态\": \"检查中\",\n" +
                    "                \"状态编号\": \"0\",\n" +
                    "                \"结束时间\": \"\",\n" +
                    "                \"派单人姓名\": \"admin\",\n" +
                    "                \"派单人ID\": \"1\",\n" +
                    "                \"人员编号\": \"8\",\n" +
                    "                \"负责人\": \"1\",\n" +
                    "                \"负责人姓名\": \"lianfd\",\n" +
                    "                \"审核人ID\": \"\",\n" +
                    "                \"审核人姓名\": \"\",\n" +
                    "                \"提交审核时间\": \"\",\n" +
                    "                \"审核时间\": \"\",\n" +
                    "                \"总工时\": \"0\"\n" +
                    "            },\n" +
                    "            {\n" +
                    "                \"CId\": \"5\",\n" +
                    "                \"单位计划编号\": \"6\",\n" +
                    "                \"合同编号\": \"测试合同1\",\n" +
                    "                \"中心编号\": \"35020301\",\n" +
                    "                \"单位编号\": \"3502030001\",\n" +
                    "                \"派单时间\": \"2010/11/25 9:43:45\",\n" +
                    "                \"预定时间\": \"\",\n" +
                    "                \"开始时间\": \"\",\n" +
                    "                \"意见\": \"\",\n" +
                    "                \"单位名称\": \"沈阳消防研究所\",\n" +
                    "                \"中心名称\": \"沈北新区监控中心\",\n" +
                    "                \"检查单状态\": \"未开始检查\",\n" +
                    "                \"状态编号\": \"5\",\n" +
                    "                \"结束时间\": \"\",\n" +
                    "                \"派单人姓名\": \"admin\",\n" +
                    "                \"派单人ID\": \"1\",\n" +
                    "                \"人员编号\": \"1\",\n" +
                    "                \"负责人\": \"1\",\n" +
                    "                \"负责人姓名\": \"admin\",\n" +
                    "                \"审核人ID\": \"\",\n" +
                    "                \"审核人姓名\": \"\",\n" +
                    "                \"提交审核时间\": \"\",\n" +
                    "                \"审核时间\": \"\",\n" +
                    "                \"总工时\": \"0\"\n" +
                    "            },\n" +
                    "            {\n" +
                    "                \"CId\": \"6\",\n" +
                    "                \"单位计划编号\": \"6\",\n" +
                    "                \"合同编号\": \"测试合同1\",\n" +
                    "                \"中心编号\": \"35020301\",\n" +
                    "                \"单位编号\": \"3502030001\",\n" +
                    "                \"派单时间\": \"2010/11/25 9:56:16\",\n" +
                    "                \"预定时间\": \"\",\n" +
                    "                \"开始时间\": \"\",\n" +
                    "                \"意见\": \"\",\n" +
                    "                \"单位名称\": \"沈阳消防研究所\",\n" +
                    "                \"中心名称\": \"沈北新区监控中心\",\n" +
                    "                \"检查单状态\": \"未开始检查\",\n" +
                    "                \"状态编号\": \"5\",\n" +
                    "                \"结束时间\": \"\",\n" +
                    "                \"派单人姓名\": \"admin\",\n" +
                    "                \"派单人ID\": \"1\",\n" +
                    "                \"人员编号\": \"1\",\n" +
                    "                \"负责人\": \"1\",\n" +
                    "                \"负责人姓名\": \"admin\",\n" +
                    "                \"审核人ID\": \"\",\n" +
                    "                \"审核人姓名\": \"\",\n" +
                    "                \"提交审核时间\": \"\",\n" +
                    "                \"审核时间\": \"\",\n" +
                    "                \"总工时\": \"0\"\n" +
                    "            },\n" +
                    "            {\n" +
                    "                \"CId\": \"7\",\n" +
                    "                \"单位计划编号\": \"5\",\n" +
                    "                \"合同编号\": \"131\",\n" +
                    "                \"中心编号\": \"35020301\",\n" +
                    "                \"单位编号\": \"3502030001\",\n" +
                    "                \"派单时间\": \"2011/8/26 10:34:18\",\n" +
                    "                \"预定时间\": \"\",\n" +
                    "                \"开始时间\": \"\",\n" +
                    "                \"意见\": \"\",\n" +
                    "                \"单位名称\": \"沈阳消防研究所\",\n" +
                    "                \"中心名称\": \"沈北新区监控中心\",\n" +
                    "                \"检查单状态\": \"未开始检查\",\n" +
                    "                \"状态编号\": \"5\",\n" +
                    "                \"结束时间\": \"\",\n" +
                    "                \"派单人姓名\": \"admin\",\n" +
                    "                \"派单人ID\": \"1\",\n" +
                    "                \"人员编号\": \"1\",\n" +
                    "                \"负责人\": \"1\",\n" +
                    "                \"负责人姓名\": \"admin\",\n" +
                    "                \"审核人ID\": \"\",\n" +
                    "                \"审核人姓名\": \"\",\n" +
                    "                \"提交审核时间\": \"\",\n" +
                    "                \"审核时间\": \"\",\n" +
                    "                \"总工时\": \"0\"\n" +
                    "            },\n" +
                    "            {\n" +
                    "                \"CId\": \"8\",\n" +
                    "                \"单位计划编号\": \"5\",\n" +
                    "                \"合同编号\": \"131\",\n" +
                    "                \"中心编号\": \"35020301\",\n" +
                    "                \"单位编号\": \"3502030001\",\n" +
                    "                \"派单时间\": \"2011/8/26 14:25:55\",\n" +
                    "                \"预定时间\": \"\",\n" +
                    "                \"开始时间\": \"\",\n" +
                    "                \"意见\": \"\",\n" +
                    "                \"单位名称\": \"沈阳消防研究所\",\n" +
                    "                \"中心名称\": \"沈北新区监控中心\",\n" +
                    "                \"检查单状态\": \"未开始检查\",\n" +
                    "                \"状态编号\": \"5\",\n" +
                    "                \"结束时间\": \"\",\n" +
                    "                \"派单人姓名\": \"admin\",\n" +
                    "                \"派单人ID\": \"1\",\n" +
                    "                \"人员编号\": \"8\",\n" +
                    "                \"负责人\": \"1\",\n" +
                    "                \"负责人姓名\": \"lianfd\",\n" +
                    "                \"审核人ID\": \"\",\n" +
                    "                \"审核人姓名\": \"\",\n" +
                    "                \"提交审核时间\": \"\",\n" +
                    "                \"审核时间\": \"\",\n" +
                    "                \"总工时\": \"0\"\n" +
                    "            },\n" +
                    "            {\n" +
                    "                \"CId\": \"9\",\n" +
                    "                \"单位计划编号\": \"4\",\n" +
                    "                \"合同编号\": \"\",\n" +
                    "                \"中心编号\": \"35020301\",\n" +
                    "                \"单位编号\": \"3502030001\",\n" +
                    "                \"派单时间\": \"2011/8/26 14:29:58\",\n" +
                    "                \"预定时间\": \"\",\n" +
                    "                \"开始时间\": \"\",\n" +
                    "                \"意见\": \"\",\n" +
                    "                \"单位名称\": \"沈阳消防研究所\",\n" +
                    "                \"中心名称\": \"沈北新区监控中心\",\n" +
                    "                \"检查单状态\": \"未开始检查\",\n" +
                    "                \"状态编号\": \"5\",\n" +
                    "                \"结束时间\": \"\",\n" +
                    "                \"派单人姓名\": \"admin\",\n" +
                    "                \"派单人ID\": \"1\",\n" +
                    "                \"人员编号\": \"8\",\n" +
                    "                \"负责人\": \"1\",\n" +
                    "                \"负责人姓名\": \"lianfd\",\n" +
                    "                \"审核人ID\": \"\",\n" +
                    "                \"审核人姓名\": \"\",\n" +
                    "                \"提交审核时间\": \"\",\n" +
                    "                \"审核时间\": \"\",\n" +
                    "                \"总工时\": \"0\"\n" +
                    "            },\n" +
                    "            {\n" +
                    "                \"CId\": \"10\",\n" +
                    "                \"单位计划编号\": \"7\",\n" +
                    "                \"合同编号\": \"155\",\n" +
                    "                \"中心编号\": \"35020301\",\n" +
                    "                \"单位编号\": \"3502030001\",\n" +
                    "                \"派单时间\": \"2011/8/26 14:32:17\",\n" +
                    "                \"预定时间\": \"\",\n" +
                    "                \"开始时间\": \"\",\n" +
                    "                \"意见\": \"\",\n" +
                    "                \"单位名称\": \"沈阳消防研究所\",\n" +
                    "                \"中心名称\": \"沈北新区监控中心\",\n" +
                    "                \"检查单状态\": \"未开始检查\",\n" +
                    "                \"状态编号\": \"5\",\n" +
                    "                \"结束时间\": \"\",\n" +
                    "                \"派单人姓名\": \"admin\",\n" +
                    "                \"派单人ID\": \"1\",\n" +
                    "                \"人员编号\": \"8\",\n" +
                    "                \"负责人\": \"1\",\n" +
                    "                \"负责人姓名\": \"lianfd\",\n" +
                    "                \"审核人ID\": \"\",\n" +
                    "                \"审核人姓名\": \"\",\n" +
                    "                \"提交审核时间\": \"\",\n" +
                    "                \"审核时间\": \"\",\n" +
                    "                \"总工时\": \"\"\n" +
                    "            },\n" +
                    "            {\n" +
                    "                \"CId\": \"11\",\n" +
                    "                \"单位计划编号\": \"7\",\n" +
                    "                \"合同编号\": \"155\",\n" +
                    "                \"中心编号\": \"35020301\",\n" +
                    "                \"单位编号\": \"3502030001\",\n" +
                    "                \"派单时间\": \"2011/8/26 14:32:31\",\n" +
                    "                \"预定时间\": \"\",\n" +
                    "                \"开始时间\": \"\",\n" +
                    "                \"意见\": \"\",\n" +
                    "                \"单位名称\": \"沈阳消防研究所\",\n" +
                    "                \"中心名称\": \"沈北新区监控中心\",\n" +
                    "                \"检查单状态\": \"未开始检查\",\n" +
                    "                \"状态编号\": \"5\",\n" +
                    "                \"结束时间\": \"\",\n" +
                    "                \"派单人姓名\": \"admin\",\n" +
                    "                \"派单人ID\": \"1\",\n" +
                    "                \"人员编号\": \"8\",\n" +
                    "                \"负责人\": \"1\",\n" +
                    "                \"负责人姓名\": \"lianfd\",\n" +
                    "                \"审核人ID\": \"\",\n" +
                    "                \"审核人姓名\": \"\",\n" +
                    "                \"提交审核时间\": \"\",\n" +
                    "                \"审核时间\": \"\",\n" +
                    "                \"总工时\": \"0\"\n" +
                    "            },\n" +
                    "            {\n" +
                    "                \"CId\": \"13\",\n" +
                    "                \"单位计划编号\": \"4\",\n" +
                    "                \"合同编号\": \"\",\n" +
                    "                \"中心编号\": \"35020301\",\n" +
                    "                \"单位编号\": \"3502030001\",\n" +
                    "                \"派单时间\": \"2011/8/29 13:52:03\",\n" +
                    "                \"预定时间\": \"\",\n" +
                    "                \"开始时间\": \"\",\n" +
                    "                \"意见\": \"\",\n" +
                    "                \"单位名称\": \"沈阳消防研究所\",\n" +
                    "                \"中心名称\": \"沈北新区监控中心\",\n" +
                    "                \"检查单状态\": \"未开始检查\",\n" +
                    "                \"状态编号\": \"5\",\n" +
                    "                \"结束时间\": \"\",\n" +
                    "                \"派单人姓名\": \"admin\",\n" +
                    "                \"派单人ID\": \"1\",\n" +
                    "                \"人员编号\": \"7\",\n" +
                    "                \"负责人\": \"1\",\n" +
                    "                \"负责人姓名\": \"lijm\",\n" +
                    "                \"审核人ID\": \"\",\n" +
                    "                \"审核人姓名\": \"\",\n" +
                    "                \"提交审核时间\": \"\",\n" +
                    "                \"审核时间\": \"\",\n" +
                    "                \"总工时\": \"0\"\n" +
                    "            },\n" +
                    "            {\n" +
                    "                \"CId\": \"14\",\n" +
                    "                \"单位计划编号\": \"4\",\n" +
                    "                \"合同编号\": \"\",\n" +
                    "                \"中心编号\": \"35020301\",\n" +
                    "                \"单位编号\": \"3502030001\",\n" +
                    "                \"派单时间\": \"2011/8/29 13:52:09\",\n" +
                    "                \"预定时间\": \"\",\n" +
                    "                \"开始时间\": \"\",\n" +
                    "                \"意见\": \"\",\n" +
                    "                \"单位名称\": \"沈阳消防研究所\",\n" +
                    "                \"中心名称\": \"沈北新区监控中心\",\n" +
                    "                \"检查单状态\": \"未开始检查\",\n" +
                    "                \"状态编号\": \"5\",\n" +
                    "                \"结束时间\": \"\",\n" +
                    "                \"派单人姓名\": \"admin\",\n" +
                    "                \"派单人ID\": \"1\",\n" +
                    "                \"人员编号\": \"7\",\n" +
                    "                \"负责人\": \"1\",\n" +
                    "                \"负责人姓名\": \"lijm\",\n" +
                    "                \"审核人ID\": \"\",\n" +
                    "                \"审核人姓名\": \"\",\n" +
                    "                \"提交审核时间\": \"\",\n" +
                    "                \"审核时间\": \"\",\n" +
                    "                \"总工时\": \"0\"\n" +
                    "            },\n" +
                    "            {\n" +
                    "                \"CId\": \"15\",\n" +
                    "                \"单位计划编号\": \"4\",\n" +
                    "                \"合同编号\": \"\",\n" +
                    "                \"中心编号\": \"35020301\",\n" +
                    "                \"单位编号\": \"3502030001\",\n" +
                    "                \"派单时间\": \"2011/8/29 13:53:59\",\n" +
                    "                \"预定时间\": \"\",\n" +
                    "                \"开始时间\": \"\",\n" +
                    "                \"意见\": \"\",\n" +
                    "                \"单位名称\": \"沈阳消防研究所\",\n" +
                    "                \"中心名称\": \"沈北新区监控中心\",\n" +
                    "                \"检查单状态\": \"未开始检查\",\n" +
                    "                \"状态编号\": \"5\",\n" +
                    "                \"结束时间\": \"\",\n" +
                    "                \"派单人姓名\": \"admin\",\n" +
                    "                \"派单人ID\": \"1\",\n" +
                    "                \"人员编号\": \"11\",\n" +
                    "                \"负责人\": \"1\",\n" +
                    "                \"负责人姓名\": \"sunrj\",\n" +
                    "                \"审核人ID\": \"\",\n" +
                    "                \"审核人姓名\": \"\",\n" +
                    "                \"提交审核时间\": \"\",\n" +
                    "                \"审核时间\": \"\",\n" +
                    "                \"总工时\": \"0\"\n" +
                    "            },\n" +
                    "            {\n" +
                    "                \"CId\": \"16\",\n" +
                    "                \"单位计划编号\": \"8\",\n" +
                    "                \"合同编号\": \"111111111\",\n" +
                    "                \"中心编号\": \"35020301\",\n" +
                    "                \"单位编号\": \"3502030001\",\n" +
                    "                \"派单时间\": \"2011/1/15 14:01:20\",\n" +
                    "                \"预定时间\": \"\",\n" +
                    "                \"开始时间\": \"\",\n" +
                    "                \"意见\": \"\",\n" +
                    "                \"单位名称\": \"沈阳消防研究所\",\n" +
                    "                \"中心名称\": \"沈北新区监控中心\",\n" +
                    "                \"检查单状态\": \"未开始检查\",\n" +
                    "                \"状态编号\": \"5\",\n" +
                    "                \"结束时间\": \"\",\n" +
                    "                \"派单人姓名\": \"admin\",\n" +
                    "                \"派单人ID\": \"1\",\n" +
                    "                \"人员编号\": \"11\",\n" +
                    "                \"负责人\": \"1\",\n" +
                    "                \"负责人姓名\": \"sunrj\",\n" +
                    "                \"审核人ID\": \"\",\n" +
                    "                \"审核人姓名\": \"\",\n" +
                    "                \"提交审核时间\": \"\",\n" +
                    "                \"审核时间\": \"\",\n" +
                    "                \"总工时\": \"0\"\n" +
                    "            },\n" +
                    "            {\n" +
                    "                \"CId\": \"17\",\n" +
                    "                \"单位计划编号\": \"5\",\n" +
                    "                \"合同编号\": \"131\",\n" +
                    "                \"中心编号\": \"35020301\",\n" +
                    "                \"单位编号\": \"3502030001\",\n" +
                    "                \"派单时间\": \"2011/3/8 13:21:49\",\n" +
                    "                \"预定时间\": \"\",\n" +
                    "                \"开始时间\": \"\",\n" +
                    "                \"意见\": \"\",\n" +
                    "                \"单位名称\": \"沈阳消防研究所\",\n" +
                    "                \"中心名称\": \"沈北新区监控中心\",\n" +
                    "                \"检查单状态\": \"未开始检查\",\n" +
                    "                \"状态编号\": \"5\",\n" +
                    "                \"结束时间\": \"\",\n" +
                    "                \"派单人姓名\": \"admin\",\n" +
                    "                \"派单人ID\": \"1\",\n" +
                    "                \"人员编号\": \"7\",\n" +
                    "                \"负责人\": \"1\",\n" +
                    "                \"负责人姓名\": \"lijm\",\n" +
                    "                \"审核人ID\": \"\",\n" +
                    "                \"审核人姓名\": \"\",\n" +
                    "                \"提交审核时间\": \"\",\n" +
                    "                \"审核时间\": \"\",\n" +
                    "                \"总工时\": \"0\"\n" +
                    "            },\n" +
                    "            {\n" +
                    "                \"CId\": \"18\",\n" +
                    "                \"单位计划编号\": \"8\",\n" +
                    "                \"合同编号\": \"111111111\",\n" +
                    "                \"中心编号\": \"35020301\",\n" +
                    "                \"单位编号\": \"3502030001\",\n" +
                    "                \"派单时间\": \"2011/3/8 13:22:33\",\n" +
                    "                \"预定时间\": \"\",\n" +
                    "                \"开始时间\": \"\",\n" +
                    "                \"意见\": \"\",\n" +
                    "                \"单位名称\": \"沈阳消防研究所\",\n" +
                    "                \"中心名称\": \"沈北新区监控中心\",\n" +
                    "                \"检查单状态\": \"未开始检查\",\n" +
                    "                \"状态编号\": \"5\",\n" +
                    "                \"结束时间\": \"\",\n" +
                    "                \"派单人姓名\": \"admin\",\n" +
                    "                \"派单人ID\": \"1\",\n" +
                    "                \"人员编号\": \"1\",\n" +
                    "                \"负责人\": \"1\",\n" +
                    "                \"负责人姓名\": \"admin\",\n" +
                    "                \"审核人ID\": \"\",\n" +
                    "                \"审核人姓名\": \"\",\n" +
                    "                \"提交审核时间\": \"\",\n" +
                    "                \"审核时间\": \"\",\n" +
                    "                \"总工时\": \"0\"\n" +
                    "            },\n" +
                    "            {\n" +
                    "                \"CId\": \"19\",\n" +
                    "                \"单位计划编号\": \"8\",\n" +
                    "                \"合同编号\": \"111111111\",\n" +
                    "                \"中心编号\": \"35020301\",\n" +
                    "                \"单位编号\": \"3502030001\",\n" +
                    "                \"派单时间\": \"2011/3/8 13:41:46\",\n" +
                    "                \"预定时间\": \"\",\n" +
                    "                \"开始时间\": \"\",\n" +
                    "                \"意见\": \"\",\n" +
                    "                \"单位名称\": \"沈阳消防研究所\",\n" +
                    "                \"中心名称\": \"沈北新区监控中心\",\n" +
                    "                \"检查单状态\": \"未开始检查\",\n" +
                    "                \"状态编号\": \"5\",\n" +
                    "                \"结束时间\": \"\",\n" +
                    "                \"派单人姓名\": \"admin\",\n" +
                    "                \"派单人ID\": \"1\",\n" +
                    "                \"人员编号\": \"7\",\n" +
                    "                \"负责人\": \"1\",\n" +
                    "                \"负责人姓名\": \"lijm\",\n" +
                    "                \"审核人ID\": \"\",\n" +
                    "                \"审核人姓名\": \"\",\n" +
                    "                \"提交审核时间\": \"\",\n" +
                    "                \"审核时间\": \"\",\n" +
                    "                \"总工时\": \"\"\n" +
                    "            },\n" +
                    "            {\n" +
                    "                \"CId\": \"22\",\n" +
                    "                \"单位计划编号\": \"8\",\n" +
                    "                \"合同编号\": \"111111111\",\n" +
                    "                \"中心编号\": \"35020301\",\n" +
                    "                \"单位编号\": \"3502030001\",\n" +
                    "                \"派单时间\": \"2011/3/8 14:51:19\",\n" +
                    "                \"预定时间\": \"2011/10/10 15:01:01\",\n" +
                    "                \"开始时间\": \"2011/10/11 15:01:11\",\n" +
                    "                \"意见\": \"\",\n" +
                    "                \"单位名称\": \"沈阳消防研究所\",\n" +
                    "                \"中心名称\": \"沈北新区监控中心\",\n" +
                    "                \"检查单状态\": \"未通过审核\",\n" +
                    "                \"状态编号\": \"2\",\n" +
                    "                \"结束时间\": \"2011/10/11 17:01:15\",\n" +
                    "                \"派单人姓名\": \"lijm\",\n" +
                    "                \"派单人ID\": \"7\",\n" +
                    "                \"人员编号\": \"7\",\n" +
                    "                \"负责人\": \"1\",\n" +
                    "                \"负责人姓名\": \"lijm\",\n" +
                    "                \"审核人ID\": \"7\",\n" +
                    "                \"审核人姓名\": \"lijm\",\n" +
                    "                \"提交审核时间\": \"\",\n" +
                    "                \"审核时间\": \"2011/10/20 15:26:12\",\n" +
                    "                \"总工时\": \"0\"\n" +
                    "            },\n" +
                    "            {\n" +
                    "                \"CId\": \"25\",\n" +
                    "                \"单位计划编号\": \"4\",\n" +
                    "                \"合同编号\": \"\",\n" +
                    "                \"中心编号\": \"35020301\",\n" +
                    "                \"单位编号\": \"3502030001\",\n" +
                    "                \"派单时间\": \"2014/12/22 14:09:08\",\n" +
                    "                \"预定时间\": \"\",\n" +
                    "                \"开始时间\": \"\",\n" +
                    "                \"意见\": \"\",\n" +
                    "                \"单位名称\": \"沈阳消防研究所\",\n" +
                    "                \"中心名称\": \"沈北新区监控中心\",\n" +
                    "                \"检查单状态\": \"未开始检查\",\n" +
                    "                \"状态编号\": \"5\",\n" +
                    "                \"结束时间\": \"\",\n" +
                    "                \"派单人姓名\": \"admin\",\n" +
                    "                \"派单人ID\": \"1\",\n" +
                    "                \"人员编号\": \"1\",\n" +
                    "                \"负责人\": \"1\",\n" +
                    "                \"负责人姓名\": \"admin\",\n" +
                    "                \"审核人ID\": \"\",\n" +
                    "                \"审核人姓名\": \"\",\n" +
                    "                \"提交审核时间\": \"\",\n" +
                    "                \"审核时间\": \"\",\n" +
                    "                \"总工时\": \"\"\n" +
                    "            },\n" +
                    "            {\n" +
                    "                \"CId\": \"20\",\n" +
                    "                \"单位计划编号\": \"9\",\n" +
                    "                \"合同编号\": \"156\",\n" +
                    "                \"中心编号\": \"35020301\",\n" +
                    "                \"单位编号\": \"3502030001\",\n" +
                    "                \"派单时间\": \"2011/3/8 13:46:38\",\n" +
                    "                \"预定时间\": \"\",\n" +
                    "                \"开始时间\": \"\",\n" +
                    "                \"意见\": \"\",\n" +
                    "                \"单位名称\": \"沈阳消防研究所\",\n" +
                    "                \"中心名称\": \"沈北新区监控中心\",\n" +
                    "                \"检查单状态\": \"未开始检查\",\n" +
                    "                \"状态编号\": \"5\",\n" +
                    "                \"结束时间\": \"\",\n" +
                    "                \"派单人姓名\": \"lijm\",\n" +
                    "                \"派单人ID\": \"7\",\n" +
                    "                \"人员编号\": \"7\",\n" +
                    "                \"负责人\": \"1\",\n" +
                    "                \"负责人姓名\": \"lijm\",\n" +
                    "                \"审核人ID\": \"\",\n" +
                    "                \"审核人姓名\": \"\",\n" +
                    "                \"提交审核时间\": \"\",\n" +
                    "                \"审核时间\": \"\",\n" +
                    "                \"总工时\": \"0\"\n" +
                    "            },\n" +
                    "            {\n" +
                    "                \"CId\": \"21\",\n" +
                    "                \"单位计划编号\": \"7\",\n" +
                    "                \"合同编号\": \"155\",\n" +
                    "                \"中心编号\": \"35020301\",\n" +
                    "                \"单位编号\": \"3502030001\",\n" +
                    "                \"派单时间\": \"2011/3/8 13:46:38\",\n" +
                    "                \"预定时间\": \"\",\n" +
                    "                \"开始时间\": \"\",\n" +
                    "                \"意见\": \"\",\n" +
                    "                \"单位名称\": \"沈阳消防研究所\",\n" +
                    "                \"中心名称\": \"沈北新区监控中心\",\n" +
                    "                \"检查单状态\": \"未开始检查\",\n" +
                    "                \"状态编号\": \"5\",\n" +
                    "                \"结束时间\": \"\",\n" +
                    "                \"派单人姓名\": \"lijm\",\n" +
                    "                \"派单人ID\": \"7\",\n" +
                    "                \"人员编号\": \"7\",\n" +
                    "                \"负责人\": \"1\",\n" +
                    "                \"负责人姓名\": \"lijm\",\n" +
                    "                \"审核人ID\": \"\",\n" +
                    "                \"审核人姓名\": \"\",\n" +
                    "                \"提交审核时间\": \"\",\n" +
                    "                \"审核时间\": \"\",\n" +
                    "                \"总工时\": \"0\"\n" +
                    "            },\n" +
                    "            {\n" +
                    "                \"CId\": \"24\",\n" +
                    "                \"单位计划编号\": \"8\",\n" +
                    "                \"合同编号\": \"111111111\",\n" +
                    "                \"中心编号\": \"35020301\",\n" +
                    "                \"单位编号\": \"3502030001\",\n" +
                    "                \"派单时间\": \"2011/3/8 15:21:08\",\n" +
                    "                \"预定时间\": \"\",\n" +
                    "                \"开始时间\": \"\",\n" +
                    "                \"意见\": \"\",\n" +
                    "                \"单位名称\": \"沈阳消防研究所\",\n" +
                    "                \"中心名称\": \"沈北新区监控中心\",\n" +
                    "                \"检查单状态\": \"检查中\",\n" +
                    "                \"状态编号\": \"0\",\n" +
                    "                \"结束时间\": \"\",\n" +
                    "                \"派单人姓名\": \"admin\",\n" +
                    "                \"派单人ID\": \"1\",\n" +
                    "                \"人员编号\": \"7\",\n" +
                    "                \"负责人\": \"1\",\n" +
                    "                \"负责人姓名\": \"lijm\",\n" +
                    "                \"审核人ID\": \"\",\n" +
                    "                \"审核人姓名\": \"\",\n" +
                    "                \"提交审核时间\": \"\",\n" +
                    "                \"审核时间\": \"\",\n" +
                    "                \"总工时\": \"0\"\n" +
                    "            }\n" +
                    "        ]\n" +
                    "    }\n" +
                    "}";
            response = new Response(body);
        }
        return response;
    }

    public List<Map<String, Object>> getTodoTaskList() throws Exception {

        Response res = _get(API_TODO_TASK_LIST, null);
        JSONObject result = res.asJSONObject();

        if (result.getBoolean("success")) {
            JSONObject data = result.getJSONObject("data");
            List<Map<String, Object>> tasks = new ArrayList<Map<String, Object>>();

            JSONArray maintainsJson = data.getJSONArray("maintain");
            for (int i = 0; i < maintainsJson.length(); i++) {
                JSONObject jo = maintainsJson.getJSONObject(i);
                tasks.add(jsonToMap(jo));
            }

            JSONArray check = data.getJSONArray("check");
            for (int i = 0; i < check.length(); i++) {
                JSONObject jo = check.getJSONObject(i);
                tasks.add(jsonToMap(jo));
            }

            return tasks;
        } else {
            throw new RuntimeException(result.getString("message"));
        }
    }
}
