package com.ruptech.firefighting.http;


import com.ruptech.firefighting.model.User;

import org.json.JSONArray;
import org.json.JSONObject;

import java.util.ArrayList;
import java.util.HashMap;
import java.util.List;
import java.util.Map;

public class HttpServer extends HttpConnection {
    private static final String API_TASK = "Task.aspx";
    private static final String API_TODO_TASK_LIST = "TaskList_todo.aspx";
    private final String TAG = HttpServer.class.getSimpleName();
    private String API_LOGIN = "user_login.php";

    // Low-level interface

    public User userLogin(String username, String password)
            throws Exception {
        Map<String, String> params = new HashMap<String, String>();
        params.put("username", username);
        params.put("password", password);

        Response res = _get(API_LOGIN, params);
        JSONObject result = res.asJSONObject();

        if (result.getBoolean("success")) {
            JSONObject data = result.getJSONObject("data");

            User user = new User(data);

            return user;
        } else {
            throw new RuntimeException(result.getString("message"));
        }
    }

    public List<Map<String, Object>> getTodoTaskList() throws Exception {

        Response res = _get(API_TODO_TASK_LIST, null);
        JSONObject result = res.asJSONObject();

        if (result.getBoolean("success")) {
            JSONObject data = result.getJSONObject("data");
            List<Map<String, Object>> tasks = new ArrayList<Map<String, Object>>();

            JSONArray maintainsJson = data.getJSONArray("maintain");
            for (int i = 0; i < maintainsJson.length(); i++) {
                JSONObject jo = maintainsJson.getJSONObject(i);
                tasks.add(jsonToMap(jo));
            }

            JSONArray check = data.getJSONArray("check");
            for (int i = 0; i < check.length(); i++) {
                JSONObject jo = check.getJSONObject(i);
                tasks.add(jsonToMap(jo));
            }

            return tasks;
        } else {
            throw new RuntimeException(result.getString("message"));
        }
    }

    public Map<String, Object> getTask(String id) throws Exception {
        Map<String, String> params = new HashMap<String, String>();
        params.put("id", id);

        Response res = _get(API_TASK, params);
        JSONObject result = res.asJSONObject();

        if (result.getBoolean("success")) {
            JSONObject data = result.getJSONObject("data");
            Map<String, Object> task = jsonToMap(data);

            return task;
        } else {
            throw new RuntimeException(result.getString("message"));
        }
    }

    protected Response _get(String ifPage, Map<String, String> params) {
        Response response = null;
        if (API_LOGIN.equals(ifPage)) {
            String body = "{ \"success\": true, \"message\": \"\", \"data\": { \"编号\": \"1\", \"用户名\": \"admin\", \"密码\": \"111111\", \"中心编号\": \"35020301\", \"真实姓名\": \"admin\", \"性别\": \"男\", \"移动电话\": \"34\", \"固定电话\": \"34\", \"邮箱\": \"3434\", \"角色编号\": \"1\", \"人员类型\": \"1\", \"人员状态\": \"1\", \"IsDel\": \"False\" } }";
            response = new Response(body);
        } else if (API_TODO_TASK_LIST.equals(ifPage)) {
            String body = "{\n" +
                    "    \"success\": true,\n" +
                    "    \"message\": \"\",\n" +
                    "    \"data\": {\n" +
                    "        \"maintain\": [\n" +
                    "            {\n" +
                    "                \"ID\": \"8\",\n" +
                    "                \"标题\": \"沈阳消防研究所\",\n" +
                    "                \"任务状态\": \"1\",\n" +
                    "                \"所属中心ID\": \"35020301\",\n" +
                    "                \"当前负责人ID\": \"1\",\n" +
                    "                \"单位ID\": \"3502030001\",\n" +
                    "                \"单位联系人\": \"123(专职消防管理人)\",\n" +
                    "                \"单位联系人电话\": \"\",\n" +
                    "                \"派单时间\": \"2011/1/21 10:09:42\",\n" +
                    "                \"提交审核时间\": \"\",\n" +
                    "                \"故障现象\": \"\",\n" +
                    "                \"故障原因\": \"\",\n" +
                    "                \"维修措施\": \"\",\n" +
                    "                \"维修总工时\": \"\",\n" +
                    "                \"审核时间\": \"\",\n" +
                    "                \"审核人ID\": \"\",\n" +
                    "                \"审核结果\": \"\",\n" +
                    "                \"不合格原因\": \"\",\n" +
                    "                \"结束时间\": \"\",\n" +
                    "                \"派单人ID\": \"1\"\n" +
                    "            },\n" +
                    "            {\n" +
                    "                \"ID\": \"9\",\n" +
                    "                \"标题\": \"沈阳消防研究所\",\n" +
                    "                \"任务状态\": \"1\",\n" +
                    "                \"所属中心ID\": \"35020301\",\n" +
                    "                \"当前负责人ID\": \"1\",\n" +
                    "                \"单位ID\": \"3502030001\",\n" +
                    "                \"单位联系人\": \"123(专职消防管理人)\",\n" +
                    "                \"单位联系人电话\": \"\",\n" +
                    "                \"派单时间\": \"2011/1/21 10:09:42\",\n" +
                    "                \"提交审核时间\": \"\",\n" +
                    "                \"故障现象\": \"建筑消防设施部件运行状态:000000001001001-故障 -------------------------------------建筑消防设施部件运行状态:000000001001001-故障 -------------------------------------建筑消防设施部件运行状态:000000001001001-故障 -------------------------------------建筑消防设施部件运行状态:000000001001001-故障\",\n" +
                    "                \"故障原因\": \"\",\n" +
                    "                \"维修措施\": \"\",\n" +
                    "                \"维修总工时\": \"\",\n" +
                    "                \"审核时间\": \"\",\n" +
                    "                \"审核人ID\": \"\",\n" +
                    "                \"审核结果\": \"\",\n" +
                    "                \"不合格原因\": \"\",\n" +
                    "                \"结束时间\": \"\",\n" +
                    "                \"派单人ID\": \"1\"\n" +
                    "            },\n" +
                    "            {\n" +
                    "                \"ID\": \"11\",\n" +
                    "                \"标题\": \"沈阳消防研究所维修\",\n" +
                    "                \"任务状态\": \"1\",\n" +
                    "                \"所属中心ID\": \"35020301\",\n" +
                    "                \"当前负责人ID\": \"1\",\n" +
                    "                \"单位ID\": \"3502030001\",\n" +
                    "                \"单位联系人\": \"123(专职消防管理人)\",\n" +
                    "                \"单位联系人电话\": \"\",\n" +
                    "                \"派单时间\": \"2011/8/26 11:25:56\",\n" +
                    "                \"提交审核时间\": \"\",\n" +
                    "                \"故障现象\": \"建筑消防设施部件运行状态:001000002001015-故障\",\n" +
                    "                \"故障原因\": \"\",\n" +
                    "                \"维修措施\": \"\",\n" +
                    "                \"维修总工时\": \"\",\n" +
                    "                \"审核时间\": \"\",\n" +
                    "                \"审核人ID\": \"\",\n" +
                    "                \"审核结果\": \"\",\n" +
                    "                \"不合格原因\": \"\",\n" +
                    "                \"结束时间\": \"\",\n" +
                    "                \"派单人ID\": \"1\"\n" +
                    "            },\n" +
                    "            {\n" +
                    "                \"ID\": \"6\",\n" +
                    "                \"标题\": \"沈阳牡丹国际大酒店有限公司牡丹酒店\",\n" +
                    "                \"任务状态\": \"1\",\n" +
                    "                \"所属中心ID\": \"35020301\",\n" +
                    "                \"当前负责人ID\": \"1\",\n" +
                    "                \"单位ID\": \"3502030006\",\n" +
                    "                \"单位联系人\": \"黎继省(消防安全管理人)\",\n" +
                    "                \"单位联系人电话\": \"\",\n" +
                    "                \"派单时间\": \"2010/11/25 11:22:45\",\n" +
                    "                \"提交审核时间\": \"\",\n" +
                    "                \"故障现象\": \"建筑消防设施部件运行状态:000000001031000-故障 -------------------------------------建筑消防设施部件运行状态:000000001031000-故障 -------------------------------------\",\n" +
                    "                \"故障原因\": \"\",\n" +
                    "                \"维修措施\": \"\",\n" +
                    "                \"维修总工时\": \"\",\n" +
                    "                \"审核时间\": \"\",\n" +
                    "                \"审核人ID\": \"\",\n" +
                    "                \"审核结果\": \"\",\n" +
                    "                \"不合格原因\": \"\",\n" +
                    "                \"结束时间\": \"\",\n" +
                    "                \"派单人ID\": \"1\"\n" +
                    "            }\n" +
                    "        ],\n" +
                    "        \"check\": [\n" +
                    "            {\n" +
                    "                \"CId\": \"2\",\n" +
                    "                \"单位计划编号\": \"5\",\n" +
                    "                \"合同编号\": \"131\",\n" +
                    "                \"中心编号\": \"35020301\",\n" +
                    "                \"单位编号\": \"3502030001\",\n" +
                    "                \"派单时间\": \"2010/11/24 16:37:49\",\n" +
                    "                \"预定时间\": \"\",\n" +
                    "                \"开始时间\": \"\",\n" +
                    "                \"意见\": \"\",\n" +
                    "                \"单位名称\": \"沈阳消防研究所\",\n" +
                    "                \"中心名称\": \"沈北新区监控中心\",\n" +
                    "                \"检查单状态\": \"检查中\",\n" +
                    "                \"状态编号\": \"0\",\n" +
                    "                \"结束时间\": \"\",\n" +
                    "                \"派单人姓名\": \"admin\",\n" +
                    "                \"派单人ID\": \"1\",\n" +
                    "                \"人员编号\": \"8\",\n" +
                    "                \"负责人\": \"1\",\n" +
                    "                \"负责人姓名\": \"lianfd\",\n" +
                    "                \"审核人ID\": \"\",\n" +
                    "                \"审核人姓名\": \"\",\n" +
                    "                \"提交审核时间\": \"\",\n" +
                    "                \"审核时间\": \"\",\n" +
                    "                \"总工时\": \"0\"\n" +
                    "            },\n" +
                    "            {\n" +
                    "                \"CId\": \"5\",\n" +
                    "                \"单位计划编号\": \"6\",\n" +
                    "                \"合同编号\": \"测试合同1\",\n" +
                    "                \"中心编号\": \"35020301\",\n" +
                    "                \"单位编号\": \"3502030001\",\n" +
                    "                \"派单时间\": \"2010/11/25 9:43:45\",\n" +
                    "                \"预定时间\": \"\",\n" +
                    "                \"开始时间\": \"\",\n" +
                    "                \"意见\": \"\",\n" +
                    "                \"单位名称\": \"沈阳消防研究所\",\n" +
                    "                \"中心名称\": \"沈北新区监控中心\",\n" +
                    "                \"检查单状态\": \"未开始检查\",\n" +
                    "                \"状态编号\": \"5\",\n" +
                    "                \"结束时间\": \"\",\n" +
                    "                \"派单人姓名\": \"admin\",\n" +
                    "                \"派单人ID\": \"1\",\n" +
                    "                \"人员编号\": \"1\",\n" +
                    "                \"负责人\": \"1\",\n" +
                    "                \"负责人姓名\": \"admin\",\n" +
                    "                \"审核人ID\": \"\",\n" +
                    "                \"审核人姓名\": \"\",\n" +
                    "                \"提交审核时间\": \"\",\n" +
                    "                \"审核时间\": \"\",\n" +
                    "                \"总工时\": \"0\"\n" +
                    "            },\n" +
                    "            {\n" +
                    "                \"CId\": \"6\",\n" +
                    "                \"单位计划编号\": \"6\",\n" +
                    "                \"合同编号\": \"测试合同1\",\n" +
                    "                \"中心编号\": \"35020301\",\n" +
                    "                \"单位编号\": \"3502030001\",\n" +
                    "                \"派单时间\": \"2010/11/25 9:56:16\",\n" +
                    "                \"预定时间\": \"\",\n" +
                    "                \"开始时间\": \"\",\n" +
                    "                \"意见\": \"\",\n" +
                    "                \"单位名称\": \"沈阳消防研究所\",\n" +
                    "                \"中心名称\": \"沈北新区监控中心\",\n" +
                    "                \"检查单状态\": \"未开始检查\",\n" +
                    "                \"状态编号\": \"5\",\n" +
                    "                \"结束时间\": \"\",\n" +
                    "                \"派单人姓名\": \"admin\",\n" +
                    "                \"派单人ID\": \"1\",\n" +
                    "                \"人员编号\": \"1\",\n" +
                    "                \"负责人\": \"1\",\n" +
                    "                \"负责人姓名\": \"admin\",\n" +
                    "                \"审核人ID\": \"\",\n" +
                    "                \"审核人姓名\": \"\",\n" +
                    "                \"提交审核时间\": \"\",\n" +
                    "                \"审核时间\": \"\",\n" +
                    "                \"总工时\": \"0\"\n" +
                    "            },\n" +
                    "            {\n" +
                    "                \"CId\": \"7\",\n" +
                    "                \"单位计划编号\": \"5\",\n" +
                    "                \"合同编号\": \"131\",\n" +
                    "                \"中心编号\": \"35020301\",\n" +
                    "                \"单位编号\": \"3502030001\",\n" +
                    "                \"派单时间\": \"2011/8/26 10:34:18\",\n" +
                    "                \"预定时间\": \"\",\n" +
                    "                \"开始时间\": \"\",\n" +
                    "                \"意见\": \"\",\n" +
                    "                \"单位名称\": \"沈阳消防研究所\",\n" +
                    "                \"中心名称\": \"沈北新区监控中心\",\n" +
                    "                \"检查单状态\": \"未开始检查\",\n" +
                    "                \"状态编号\": \"5\",\n" +
                    "                \"结束时间\": \"\",\n" +
                    "                \"派单人姓名\": \"admin\",\n" +
                    "                \"派单人ID\": \"1\",\n" +
                    "                \"人员编号\": \"1\",\n" +
                    "                \"负责人\": \"1\",\n" +
                    "                \"负责人姓名\": \"admin\",\n" +
                    "                \"审核人ID\": \"\",\n" +
                    "                \"审核人姓名\": \"\",\n" +
                    "                \"提交审核时间\": \"\",\n" +
                    "                \"审核时间\": \"\",\n" +
                    "                \"总工时\": \"0\"\n" +
                    "            },\n" +
                    "            {\n" +
                    "                \"CId\": \"8\",\n" +
                    "                \"单位计划编号\": \"5\",\n" +
                    "                \"合同编号\": \"131\",\n" +
                    "                \"中心编号\": \"35020301\",\n" +
                    "                \"单位编号\": \"3502030001\",\n" +
                    "                \"派单时间\": \"2011/8/26 14:25:55\",\n" +
                    "                \"预定时间\": \"\",\n" +
                    "                \"开始时间\": \"\",\n" +
                    "                \"意见\": \"\",\n" +
                    "                \"单位名称\": \"沈阳消防研究所\",\n" +
                    "                \"中心名称\": \"沈北新区监控中心\",\n" +
                    "                \"检查单状态\": \"未开始检查\",\n" +
                    "                \"状态编号\": \"5\",\n" +
                    "                \"结束时间\": \"\",\n" +
                    "                \"派单人姓名\": \"admin\",\n" +
                    "                \"派单人ID\": \"1\",\n" +
                    "                \"人员编号\": \"8\",\n" +
                    "                \"负责人\": \"1\",\n" +
                    "                \"负责人姓名\": \"lianfd\",\n" +
                    "                \"审核人ID\": \"\",\n" +
                    "                \"审核人姓名\": \"\",\n" +
                    "                \"提交审核时间\": \"\",\n" +
                    "                \"审核时间\": \"\",\n" +
                    "                \"总工时\": \"0\"\n" +
                    "            },\n" +
                    "            {\n" +
                    "                \"CId\": \"9\",\n" +
                    "                \"单位计划编号\": \"4\",\n" +
                    "                \"合同编号\": \"\",\n" +
                    "                \"中心编号\": \"35020301\",\n" +
                    "                \"单位编号\": \"3502030001\",\n" +
                    "                \"派单时间\": \"2011/8/26 14:29:58\",\n" +
                    "                \"预定时间\": \"\",\n" +
                    "                \"开始时间\": \"\",\n" +
                    "                \"意见\": \"\",\n" +
                    "                \"单位名称\": \"沈阳消防研究所\",\n" +
                    "                \"中心名称\": \"沈北新区监控中心\",\n" +
                    "                \"检查单状态\": \"未开始检查\",\n" +
                    "                \"状态编号\": \"5\",\n" +
                    "                \"结束时间\": \"\",\n" +
                    "                \"派单人姓名\": \"admin\",\n" +
                    "                \"派单人ID\": \"1\",\n" +
                    "                \"人员编号\": \"8\",\n" +
                    "                \"负责人\": \"1\",\n" +
                    "                \"负责人姓名\": \"lianfd\",\n" +
                    "                \"审核人ID\": \"\",\n" +
                    "                \"审核人姓名\": \"\",\n" +
                    "                \"提交审核时间\": \"\",\n" +
                    "                \"审核时间\": \"\",\n" +
                    "                \"总工时\": \"0\"\n" +
                    "            },\n" +
                    "            {\n" +
                    "                \"CId\": \"10\",\n" +
                    "                \"单位计划编号\": \"7\",\n" +
                    "                \"合同编号\": \"155\",\n" +
                    "                \"中心编号\": \"35020301\",\n" +
                    "                \"单位编号\": \"3502030001\",\n" +
                    "                \"派单时间\": \"2011/8/26 14:32:17\",\n" +
                    "                \"预定时间\": \"\",\n" +
                    "                \"开始时间\": \"\",\n" +
                    "                \"意见\": \"\",\n" +
                    "                \"单位名称\": \"沈阳消防研究所\",\n" +
                    "                \"中心名称\": \"沈北新区监控中心\",\n" +
                    "                \"检查单状态\": \"未开始检查\",\n" +
                    "                \"状态编号\": \"5\",\n" +
                    "                \"结束时间\": \"\",\n" +
                    "                \"派单人姓名\": \"admin\",\n" +
                    "                \"派单人ID\": \"1\",\n" +
                    "                \"人员编号\": \"8\",\n" +
                    "                \"负责人\": \"1\",\n" +
                    "                \"负责人姓名\": \"lianfd\",\n" +
                    "                \"审核人ID\": \"\",\n" +
                    "                \"审核人姓名\": \"\",\n" +
                    "                \"提交审核时间\": \"\",\n" +
                    "                \"审核时间\": \"\",\n" +
                    "                \"总工时\": \"\"\n" +
                    "            },\n" +
                    "            {\n" +
                    "                \"CId\": \"11\",\n" +
                    "                \"单位计划编号\": \"7\",\n" +
                    "                \"合同编号\": \"155\",\n" +
                    "                \"中心编号\": \"35020301\",\n" +
                    "                \"单位编号\": \"3502030001\",\n" +
                    "                \"派单时间\": \"2011/8/26 14:32:31\",\n" +
                    "                \"预定时间\": \"\",\n" +
                    "                \"开始时间\": \"\",\n" +
                    "                \"意见\": \"\",\n" +
                    "                \"单位名称\": \"沈阳消防研究所\",\n" +
                    "                \"中心名称\": \"沈北新区监控中心\",\n" +
                    "                \"检查单状态\": \"未开始检查\",\n" +
                    "                \"状态编号\": \"5\",\n" +
                    "                \"结束时间\": \"\",\n" +
                    "                \"派单人姓名\": \"admin\",\n" +
                    "                \"派单人ID\": \"1\",\n" +
                    "                \"人员编号\": \"8\",\n" +
                    "                \"负责人\": \"1\",\n" +
                    "                \"负责人姓名\": \"lianfd\",\n" +
                    "                \"审核人ID\": \"\",\n" +
                    "                \"审核人姓名\": \"\",\n" +
                    "                \"提交审核时间\": \"\",\n" +
                    "                \"审核时间\": \"\",\n" +
                    "                \"总工时\": \"0\"\n" +
                    "            },\n" +
                    "            {\n" +
                    "                \"CId\": \"13\",\n" +
                    "                \"单位计划编号\": \"4\",\n" +
                    "                \"合同编号\": \"\",\n" +
                    "                \"中心编号\": \"35020301\",\n" +
                    "                \"单位编号\": \"3502030001\",\n" +
                    "                \"派单时间\": \"2011/8/29 13:52:03\",\n" +
                    "                \"预定时间\": \"\",\n" +
                    "                \"开始时间\": \"\",\n" +
                    "                \"意见\": \"\",\n" +
                    "                \"单位名称\": \"沈阳消防研究所\",\n" +
                    "                \"中心名称\": \"沈北新区监控中心\",\n" +
                    "                \"检查单状态\": \"未开始检查\",\n" +
                    "                \"状态编号\": \"5\",\n" +
                    "                \"结束时间\": \"\",\n" +
                    "                \"派单人姓名\": \"admin\",\n" +
                    "                \"派单人ID\": \"1\",\n" +
                    "                \"人员编号\": \"7\",\n" +
                    "                \"负责人\": \"1\",\n" +
                    "                \"负责人姓名\": \"lijm\",\n" +
                    "                \"审核人ID\": \"\",\n" +
                    "                \"审核人姓名\": \"\",\n" +
                    "                \"提交审核时间\": \"\",\n" +
                    "                \"审核时间\": \"\",\n" +
                    "                \"总工时\": \"0\"\n" +
                    "            },\n" +
                    "            {\n" +
                    "                \"CId\": \"14\",\n" +
                    "                \"单位计划编号\": \"4\",\n" +
                    "                \"合同编号\": \"\",\n" +
                    "                \"中心编号\": \"35020301\",\n" +
                    "                \"单位编号\": \"3502030001\",\n" +
                    "                \"派单时间\": \"2011/8/29 13:52:09\",\n" +
                    "                \"预定时间\": \"\",\n" +
                    "                \"开始时间\": \"\",\n" +
                    "                \"意见\": \"\",\n" +
                    "                \"单位名称\": \"沈阳消防研究所\",\n" +
                    "                \"中心名称\": \"沈北新区监控中心\",\n" +
                    "                \"检查单状态\": \"未开始检查\",\n" +
                    "                \"状态编号\": \"5\",\n" +
                    "                \"结束时间\": \"\",\n" +
                    "                \"派单人姓名\": \"admin\",\n" +
                    "                \"派单人ID\": \"1\",\n" +
                    "                \"人员编号\": \"7\",\n" +
                    "                \"负责人\": \"1\",\n" +
                    "                \"负责人姓名\": \"lijm\",\n" +
                    "                \"审核人ID\": \"\",\n" +
                    "                \"审核人姓名\": \"\",\n" +
                    "                \"提交审核时间\": \"\",\n" +
                    "                \"审核时间\": \"\",\n" +
                    "                \"总工时\": \"0\"\n" +
                    "            },\n" +
                    "            {\n" +
                    "                \"CId\": \"15\",\n" +
                    "                \"单位计划编号\": \"4\",\n" +
                    "                \"合同编号\": \"\",\n" +
                    "                \"中心编号\": \"35020301\",\n" +
                    "                \"单位编号\": \"3502030001\",\n" +
                    "                \"派单时间\": \"2011/8/29 13:53:59\",\n" +
                    "                \"预定时间\": \"\",\n" +
                    "                \"开始时间\": \"\",\n" +
                    "                \"意见\": \"\",\n" +
                    "                \"单位名称\": \"沈阳消防研究所\",\n" +
                    "                \"中心名称\": \"沈北新区监控中心\",\n" +
                    "                \"检查单状态\": \"未开始检查\",\n" +
                    "                \"状态编号\": \"5\",\n" +
                    "                \"结束时间\": \"\",\n" +
                    "                \"派单人姓名\": \"admin\",\n" +
                    "                \"派单人ID\": \"1\",\n" +
                    "                \"人员编号\": \"11\",\n" +
                    "                \"负责人\": \"1\",\n" +
                    "                \"负责人姓名\": \"sunrj\",\n" +
                    "                \"审核人ID\": \"\",\n" +
                    "                \"审核人姓名\": \"\",\n" +
                    "                \"提交审核时间\": \"\",\n" +
                    "                \"审核时间\": \"\",\n" +
                    "                \"总工时\": \"0\"\n" +
                    "            },\n" +
                    "            {\n" +
                    "                \"CId\": \"16\",\n" +
                    "                \"单位计划编号\": \"8\",\n" +
                    "                \"合同编号\": \"111111111\",\n" +
                    "                \"中心编号\": \"35020301\",\n" +
                    "                \"单位编号\": \"3502030001\",\n" +
                    "                \"派单时间\": \"2011/1/15 14:01:20\",\n" +
                    "                \"预定时间\": \"\",\n" +
                    "                \"开始时间\": \"\",\n" +
                    "                \"意见\": \"\",\n" +
                    "                \"单位名称\": \"沈阳消防研究所\",\n" +
                    "                \"中心名称\": \"沈北新区监控中心\",\n" +
                    "                \"检查单状态\": \"未开始检查\",\n" +
                    "                \"状态编号\": \"5\",\n" +
                    "                \"结束时间\": \"\",\n" +
                    "                \"派单人姓名\": \"admin\",\n" +
                    "                \"派单人ID\": \"1\",\n" +
                    "                \"人员编号\": \"11\",\n" +
                    "                \"负责人\": \"1\",\n" +
                    "                \"负责人姓名\": \"sunrj\",\n" +
                    "                \"审核人ID\": \"\",\n" +
                    "                \"审核人姓名\": \"\",\n" +
                    "                \"提交审核时间\": \"\",\n" +
                    "                \"审核时间\": \"\",\n" +
                    "                \"总工时\": \"0\"\n" +
                    "            },\n" +
                    "            {\n" +
                    "                \"CId\": \"17\",\n" +
                    "                \"单位计划编号\": \"5\",\n" +
                    "                \"合同编号\": \"131\",\n" +
                    "                \"中心编号\": \"35020301\",\n" +
                    "                \"单位编号\": \"3502030001\",\n" +
                    "                \"派单时间\": \"2011/3/8 13:21:49\",\n" +
                    "                \"预定时间\": \"\",\n" +
                    "                \"开始时间\": \"\",\n" +
                    "                \"意见\": \"\",\n" +
                    "                \"单位名称\": \"沈阳消防研究所\",\n" +
                    "                \"中心名称\": \"沈北新区监控中心\",\n" +
                    "                \"检查单状态\": \"未开始检查\",\n" +
                    "                \"状态编号\": \"5\",\n" +
                    "                \"结束时间\": \"\",\n" +
                    "                \"派单人姓名\": \"admin\",\n" +
                    "                \"派单人ID\": \"1\",\n" +
                    "                \"人员编号\": \"7\",\n" +
                    "                \"负责人\": \"1\",\n" +
                    "                \"负责人姓名\": \"lijm\",\n" +
                    "                \"审核人ID\": \"\",\n" +
                    "                \"审核人姓名\": \"\",\n" +
                    "                \"提交审核时间\": \"\",\n" +
                    "                \"审核时间\": \"\",\n" +
                    "                \"总工时\": \"0\"\n" +
                    "            },\n" +
                    "            {\n" +
                    "                \"CId\": \"18\",\n" +
                    "                \"单位计划编号\": \"8\",\n" +
                    "                \"合同编号\": \"111111111\",\n" +
                    "                \"中心编号\": \"35020301\",\n" +
                    "                \"单位编号\": \"3502030001\",\n" +
                    "                \"派单时间\": \"2011/3/8 13:22:33\",\n" +
                    "                \"预定时间\": \"\",\n" +
                    "                \"开始时间\": \"\",\n" +
                    "                \"意见\": \"\",\n" +
                    "                \"单位名称\": \"沈阳消防研究所\",\n" +
                    "                \"中心名称\": \"沈北新区监控中心\",\n" +
                    "                \"检查单状态\": \"未开始检查\",\n" +
                    "                \"状态编号\": \"5\",\n" +
                    "                \"结束时间\": \"\",\n" +
                    "                \"派单人姓名\": \"admin\",\n" +
                    "                \"派单人ID\": \"1\",\n" +
                    "                \"人员编号\": \"1\",\n" +
                    "                \"负责人\": \"1\",\n" +
                    "                \"负责人姓名\": \"admin\",\n" +
                    "                \"审核人ID\": \"\",\n" +
                    "                \"审核人姓名\": \"\",\n" +
                    "                \"提交审核时间\": \"\",\n" +
                    "                \"审核时间\": \"\",\n" +
                    "                \"总工时\": \"0\"\n" +
                    "            },\n" +
                    "            {\n" +
                    "                \"CId\": \"19\",\n" +
                    "                \"单位计划编号\": \"8\",\n" +
                    "                \"合同编号\": \"111111111\",\n" +
                    "                \"中心编号\": \"35020301\",\n" +
                    "                \"单位编号\": \"3502030001\",\n" +
                    "                \"派单时间\": \"2011/3/8 13:41:46\",\n" +
                    "                \"预定时间\": \"\",\n" +
                    "                \"开始时间\": \"\",\n" +
                    "                \"意见\": \"\",\n" +
                    "                \"单位名称\": \"沈阳消防研究所\",\n" +
                    "                \"中心名称\": \"沈北新区监控中心\",\n" +
                    "                \"检查单状态\": \"未开始检查\",\n" +
                    "                \"状态编号\": \"5\",\n" +
                    "                \"结束时间\": \"\",\n" +
                    "                \"派单人姓名\": \"admin\",\n" +
                    "                \"派单人ID\": \"1\",\n" +
                    "                \"人员编号\": \"7\",\n" +
                    "                \"负责人\": \"1\",\n" +
                    "                \"负责人姓名\": \"lijm\",\n" +
                    "                \"审核人ID\": \"\",\n" +
                    "                \"审核人姓名\": \"\",\n" +
                    "                \"提交审核时间\": \"\",\n" +
                    "                \"审核时间\": \"\",\n" +
                    "                \"总工时\": \"\"\n" +
                    "            },\n" +
                    "            {\n" +
                    "                \"CId\": \"22\",\n" +
                    "                \"单位计划编号\": \"8\",\n" +
                    "                \"合同编号\": \"111111111\",\n" +
                    "                \"中心编号\": \"35020301\",\n" +
                    "                \"单位编号\": \"3502030001\",\n" +
                    "                \"派单时间\": \"2011/3/8 14:51:19\",\n" +
                    "                \"预定时间\": \"2011/10/10 15:01:01\",\n" +
                    "                \"开始时间\": \"2011/10/11 15:01:11\",\n" +
                    "                \"意见\": \"\",\n" +
                    "                \"单位名称\": \"沈阳消防研究所\",\n" +
                    "                \"中心名称\": \"沈北新区监控中心\",\n" +
                    "                \"检查单状态\": \"未通过审核\",\n" +
                    "                \"状态编号\": \"2\",\n" +
                    "                \"结束时间\": \"2011/10/11 17:01:15\",\n" +
                    "                \"派单人姓名\": \"lijm\",\n" +
                    "                \"派单人ID\": \"7\",\n" +
                    "                \"人员编号\": \"7\",\n" +
                    "                \"负责人\": \"1\",\n" +
                    "                \"负责人姓名\": \"lijm\",\n" +
                    "                \"审核人ID\": \"7\",\n" +
                    "                \"审核人姓名\": \"lijm\",\n" +
                    "                \"提交审核时间\": \"\",\n" +
                    "                \"审核时间\": \"2011/10/20 15:26:12\",\n" +
                    "                \"总工时\": \"0\"\n" +
                    "            },\n" +
                    "            {\n" +
                    "                \"CId\": \"25\",\n" +
                    "                \"单位计划编号\": \"4\",\n" +
                    "                \"合同编号\": \"\",\n" +
                    "                \"中心编号\": \"35020301\",\n" +
                    "                \"单位编号\": \"3502030001\",\n" +
                    "                \"派单时间\": \"2014/12/22 14:09:08\",\n" +
                    "                \"预定时间\": \"\",\n" +
                    "                \"开始时间\": \"\",\n" +
                    "                \"意见\": \"\",\n" +
                    "                \"单位名称\": \"沈阳消防研究所\",\n" +
                    "                \"中心名称\": \"沈北新区监控中心\",\n" +
                    "                \"检查单状态\": \"未开始检查\",\n" +
                    "                \"状态编号\": \"5\",\n" +
                    "                \"结束时间\": \"\",\n" +
                    "                \"派单人姓名\": \"admin\",\n" +
                    "                \"派单人ID\": \"1\",\n" +
                    "                \"人员编号\": \"1\",\n" +
                    "                \"负责人\": \"1\",\n" +
                    "                \"负责人姓名\": \"admin\",\n" +
                    "                \"审核人ID\": \"\",\n" +
                    "                \"审核人姓名\": \"\",\n" +
                    "                \"提交审核时间\": \"\",\n" +
                    "                \"审核时间\": \"\",\n" +
                    "                \"总工时\": \"\"\n" +
                    "            },\n" +
                    "            {\n" +
                    "                \"CId\": \"20\",\n" +
                    "                \"单位计划编号\": \"9\",\n" +
                    "                \"合同编号\": \"156\",\n" +
                    "                \"中心编号\": \"35020301\",\n" +
                    "                \"单位编号\": \"3502030001\",\n" +
                    "                \"派单时间\": \"2011/3/8 13:46:38\",\n" +
                    "                \"预定时间\": \"\",\n" +
                    "                \"开始时间\": \"\",\n" +
                    "                \"意见\": \"\",\n" +
                    "                \"单位名称\": \"沈阳消防研究所\",\n" +
                    "                \"中心名称\": \"沈北新区监控中心\",\n" +
                    "                \"检查单状态\": \"未开始检查\",\n" +
                    "                \"状态编号\": \"5\",\n" +
                    "                \"结束时间\": \"\",\n" +
                    "                \"派单人姓名\": \"lijm\",\n" +
                    "                \"派单人ID\": \"7\",\n" +
                    "                \"人员编号\": \"7\",\n" +
                    "                \"负责人\": \"1\",\n" +
                    "                \"负责人姓名\": \"lijm\",\n" +
                    "                \"审核人ID\": \"\",\n" +
                    "                \"审核人姓名\": \"\",\n" +
                    "                \"提交审核时间\": \"\",\n" +
                    "                \"审核时间\": \"\",\n" +
                    "                \"总工时\": \"0\"\n" +
                    "            },\n" +
                    "            {\n" +
                    "                \"CId\": \"21\",\n" +
                    "                \"单位计划编号\": \"7\",\n" +
                    "                \"合同编号\": \"155\",\n" +
                    "                \"中心编号\": \"35020301\",\n" +
                    "                \"单位编号\": \"3502030001\",\n" +
                    "                \"派单时间\": \"2011/3/8 13:46:38\",\n" +
                    "                \"预定时间\": \"\",\n" +
                    "                \"开始时间\": \"\",\n" +
                    "                \"意见\": \"\",\n" +
                    "                \"单位名称\": \"沈阳消防研究所\",\n" +
                    "                \"中心名称\": \"沈北新区监控中心\",\n" +
                    "                \"检查单状态\": \"未开始检查\",\n" +
                    "                \"状态编号\": \"5\",\n" +
                    "                \"结束时间\": \"\",\n" +
                    "                \"派单人姓名\": \"lijm\",\n" +
                    "                \"派单人ID\": \"7\",\n" +
                    "                \"人员编号\": \"7\",\n" +
                    "                \"负责人\": \"1\",\n" +
                    "                \"负责人姓名\": \"lijm\",\n" +
                    "                \"审核人ID\": \"\",\n" +
                    "                \"审核人姓名\": \"\",\n" +
                    "                \"提交审核时间\": \"\",\n" +
                    "                \"审核时间\": \"\",\n" +
                    "                \"总工时\": \"0\"\n" +
                    "            },\n" +
                    "            {\n" +
                    "                \"CId\": \"24\",\n" +
                    "                \"单位计划编号\": \"8\",\n" +
                    "                \"合同编号\": \"111111111\",\n" +
                    "                \"中心编号\": \"35020301\",\n" +
                    "                \"单位编号\": \"3502030001\",\n" +
                    "                \"派单时间\": \"2011/3/8 15:21:08\",\n" +
                    "                \"预定时间\": \"\",\n" +
                    "                \"开始时间\": \"\",\n" +
                    "                \"意见\": \"\",\n" +
                    "                \"单位名称\": \"沈阳消防研究所\",\n" +
                    "                \"中心名称\": \"沈北新区监控中心\",\n" +
                    "                \"检查单状态\": \"检查中\",\n" +
                    "                \"状态编号\": \"0\",\n" +
                    "                \"结束时间\": \"\",\n" +
                    "                \"派单人姓名\": \"admin\",\n" +
                    "                \"派单人ID\": \"1\",\n" +
                    "                \"人员编号\": \"7\",\n" +
                    "                \"负责人\": \"1\",\n" +
                    "                \"负责人姓名\": \"lijm\",\n" +
                    "                \"审核人ID\": \"\",\n" +
                    "                \"审核人姓名\": \"\",\n" +
                    "                \"提交审核时间\": \"\",\n" +
                    "                \"审核时间\": \"\",\n" +
                    "                \"总工时\": \"0\"\n" +
                    "            }\n" +
                    "        ]\n" +
                    "    }\n" +
                    "}";
            response = new Response(body);
        } else if (API_TASK.equals(ifPage)) {
            String body = "{\n" +
                    "    \"success\": true,\n" +
                    "    \"message\": \"\",\n" +
                    "    \"data\": {\n" +
                    "        \"task\": {\n" +
                    "            \"ID\": \"3\",\n" +
                    "            \"标题\": \"沈阳消防研究所维修\",\n" +
                    "            \"任务状态\": \"6\",\n" +
                    "            \"所属中心ID\": \"35020301\",\n" +
                    "            \"当前负责人ID\": \"7\",\n" +
                    "            \"单位ID\": \"3502030001\",\n" +
                    "            \"单位联系人\": \"123(专职消防管理人)\",\n" +
                    "            \"单位联系人电话\": \"\",\n" +
                    "            \"派单时间\": \"2010/11/25 10:00:38\",\n" +
                    "            \"提交审核时间\": \"2010/11/25 10:17:26\",\n" +
                    "            \"故障现象\": \"12112\",\n" +
                    "            \"故障原因\": \"121212\",\n" +
                    "            \"维修措施\": \"12121212\",\n" +
                    "            \"维修总工时\": \"45\",\n" +
                    "            \"审核时间\": \"2010/11/25 10:21:01\",\n" +
                    "            \"审核人ID\": \"7\",\n" +
                    "            \"审核结果\": \"1\",\n" +
                    "            \"不合格原因\": \"121212\",\n" +
                    "            \"结束时间\": \"2010/11/25 10:21:01\",\n" +
                    "            \"派单人ID\": \"1\",\n" +
                    "            \"当前负责人姓名\": \"lijm\",\n" +
                    "            \"派单人姓名\": \"admin\"\n" +
                    "        },\n" +
                    "        \"worklogs\": [\n" +
                    "            {\n" +
                    "                \"ID\": \"3\",\n" +
                    "                \"维修任务ID\": \"3\",\n" +
                    "                \"标题\": \"123\",\n" +
                    "                \"维修工作描述\": \"123333\",\n" +
                    "                \"录入人员信息ID\": \"1\",\n" +
                    "                \"录入时间\": \"2010/11/25 10:02:41\",\n" +
                    "                \"是否提交\": \"1\",\n" +
                    "                \"workhours\": [\n" +
                    "                    {\n" +
                    "                        \"ID\": \"3\",\n" +
                    "                        \"维修过程ID\": \"3\",\n" +
                    "                        \"维修人员ID\": \"1\",\n" +
                    "                        \"开始时间\": \"\",\n" +
                    "                        \"结束时间\": \"\",\n" +
                    "                        \"工时\": \"1\",\n" +
                    "                        \"维修人员姓名\": \"admin\"\n" +
                    "                    },\n" +
                    "                    {\n" +
                    "                        \"ID\": \"4\",\n" +
                    "                        \"维修过程ID\": \"3\",\n" +
                    "                        \"维修人员ID\": \"7\",\n" +
                    "                        \"开始时间\": \"\",\n" +
                    "                        \"结束时间\": \"\",\n" +
                    "                        \"工时\": \"2.5\",\n" +
                    "                        \"维修人员姓名\": \"lijm\"\n" +
                    "                    },\n" +
                    "                    {\n" +
                    "                        \"ID\": \"5\",\n" +
                    "                        \"维修过程ID\": \"3\",\n" +
                    "                        \"维修人员ID\": \"10\",\n" +
                    "                        \"开始时间\": \"\",\n" +
                    "                        \"结束时间\": \"\",\n" +
                    "                        \"工时\": \"2\",\n" +
                    "                        \"维修人员姓名\": \"yandf\"\n" +
                    "                    }\n" +
                    "                ]\n" +
                    "            },\n" +
                    "            {\n" +
                    "                \"ID\": \"4\",\n" +
                    "                \"维修任务ID\": \"3\",\n" +
                    "                \"标题\": \"1212\",\n" +
                    "                \"维修工作描述\": \"12121212\",\n" +
                    "                \"录入人员信息ID\": \"1\",\n" +
                    "                \"录入时间\": \"2010/11/25 10:02:53\",\n" +
                    "                \"是否提交\": \"1\",\n" +
                    "                \"workhours\": [\n" +
                    "                    {\n" +
                    "                        \"ID\": \"6\",\n" +
                    "                        \"维修过程ID\": \"4\",\n" +
                    "                        \"维修人员ID\": \"1\",\n" +
                    "                        \"开始时间\": \"\",\n" +
                    "                        \"结束时间\": \"\",\n" +
                    "                        \"工时\": \"1\",\n" +
                    "                        \"维修人员姓名\": \"admin\"\n" +
                    "                    },\n" +
                    "                    {\n" +
                    "                        \"ID\": \"7\",\n" +
                    "                        \"维修过程ID\": \"4\",\n" +
                    "                        \"维修人员ID\": \"7\",\n" +
                    "                        \"开始时间\": \"\",\n" +
                    "                        \"结束时间\": \"\",\n" +
                    "                        \"工时\": \"1.5\",\n" +
                    "                        \"维修人员姓名\": \"lijm\"\n" +
                    "                    },\n" +
                    "                    {\n" +
                    "                        \"ID\": \"8\",\n" +
                    "                        \"维修过程ID\": \"4\",\n" +
                    "                        \"维修人员ID\": \"10\",\n" +
                    "                        \"开始时间\": \"\",\n" +
                    "                        \"结束时间\": \"\",\n" +
                    "                        \"工时\": \"1\",\n" +
                    "                        \"维修人员姓名\": \"yandf\"\n" +
                    "                    }\n" +
                    "                ]\n" +
                    "            },\n" +
                    "            {\n" +
                    "                \"ID\": \"5\",\n" +
                    "                \"维修任务ID\": \"3\",\n" +
                    "                \"标题\": \"1212\",\n" +
                    "                \"维修工作描述\": \"121\",\n" +
                    "                \"录入人员信息ID\": \"1\",\n" +
                    "                \"录入时间\": \"2010/11/25 10:07:31\",\n" +
                    "                \"是否提交\": \"1\",\n" +
                    "                \"workhours\": [\n" +
                    "                    {\n" +
                    "                        \"ID\": \"9\",\n" +
                    "                        \"维修过程ID\": \"5\",\n" +
                    "                        \"维修人员ID\": \"1\",\n" +
                    "                        \"开始时间\": \"2010/11/25 10:05:10\",\n" +
                    "                        \"结束时间\": \"2010/11/25 19:05:47\",\n" +
                    "                        \"工时\": \"9\",\n" +
                    "                        \"维修人员姓名\": \"admin\"\n" +
                    "                    },\n" +
                    "                    {\n" +
                    "                        \"ID\": \"10\",\n" +
                    "                        \"维修过程ID\": \"5\",\n" +
                    "                        \"维修人员ID\": \"7\",\n" +
                    "                        \"开始时间\": \"2010/11/25 7:06:05\",\n" +
                    "                        \"结束时间\": \"2010/11/26 10:05:28\",\n" +
                    "                        \"工时\": \"27\",\n" +
                    "                        \"维修人员姓名\": \"lijm\"\n" +
                    "                    }\n" +
                    "                ]\n" +
                    "            },\n" +
                    "            {\n" +
                    "                \"ID\": \"12\",\n" +
                    "                \"维修任务ID\": \"3\",\n" +
                    "                \"标题\": \"1\",\n" +
                    "                \"维修工作描述\": \"2\",\n" +
                    "                \"录入人员信息ID\": \"7\",\n" +
                    "                \"录入时间\": \"2014/12/22 14:38:15\",\n" +
                    "                \"是否提交\": \"0\",\n" +
                    "                \"workhours\": []\n" +
                    "            },\n" +
                    "            {\n" +
                    "                \"ID\": \"21\",\n" +
                    "                \"维修任务ID\": \"3\",\n" +
                    "                \"标题\": \"1\",\n" +
                    "                \"维修工作描述\": \"2\",\n" +
                    "                \"录入人员信息ID\": \"7\",\n" +
                    "                \"录入时间\": \"2014/12/22 14:38:15\",\n" +
                    "                \"是否提交\": \"0\",\n" +
                    "                \"workhours\": []\n" +
                    "            },\n" +
                    "            {\n" +
                    "                \"ID\": \"23\",\n" +
                    "                \"维修任务ID\": \"3\",\n" +
                    "                \"标题\": \"1\",\n" +
                    "                \"维修工作描述\": \"2\",\n" +
                    "                \"录入人员信息ID\": \"7\",\n" +
                    "                \"录入时间\": \"2014/12/29 14:16:00\",\n" +
                    "                \"是否提交\": \"0\",\n" +
                    "                \"workhours\": []\n" +
                    "            },\n" +
                    "            {\n" +
                    "                \"ID\": \"24\",\n" +
                    "                \"维修任务ID\": \"3\",\n" +
                    "                \"标题\": \"1\",\n" +
                    "                \"维修工作描述\": \"2\",\n" +
                    "                \"录入人员信息ID\": \"7\",\n" +
                    "                \"录入时间\": \"2014/12/29 14:16:00\",\n" +
                    "                \"是否提交\": \"0\",\n" +
                    "                \"workhours\": []\n" +
                    "            },\n" +
                    "            {\n" +
                    "                \"ID\": \"25\",\n" +
                    "                \"维修任务ID\": \"3\",\n" +
                    "                \"标题\": \"1\",\n" +
                    "                \"维修工作描述\": \"2\",\n" +
                    "                \"录入人员信息ID\": \"7\",\n" +
                    "                \"录入时间\": \"2014/12/29 14:16:00\",\n" +
                    "                \"是否提交\": \"0\",\n" +
                    "                \"workhours\": []\n" +
                    "            },\n" +
                    "            {\n" +
                    "                \"ID\": \"26\",\n" +
                    "                \"维修任务ID\": \"3\",\n" +
                    "                \"标题\": \"1\",\n" +
                    "                \"维修工作描述\": \"2\",\n" +
                    "                \"录入人员信息ID\": \"7\",\n" +
                    "                \"录入时间\": \"2014/12/29 14:16:00\",\n" +
                    "                \"是否提交\": \"0\",\n" +
                    "                \"workhours\": []\n" +
                    "            },\n" +
                    "            {\n" +
                    "                \"ID\": \"27\",\n" +
                    "                \"维修任务ID\": \"3\",\n" +
                    "                \"标题\": \"1\",\n" +
                    "                \"维修工作描述\": \"2\",\n" +
                    "                \"录入人员信息ID\": \"7\",\n" +
                    "                \"录入时间\": \"2014/12/29 14:16:00\",\n" +
                    "                \"是否提交\": \"0\",\n" +
                    "                \"workhours\": []\n" +
                    "            },\n" +
                    "            {\n" +
                    "                \"ID\": \"28\",\n" +
                    "                \"维修任务ID\": \"3\",\n" +
                    "                \"标题\": \"1\",\n" +
                    "                \"维修工作描述\": \"2\",\n" +
                    "                \"录入人员信息ID\": \"7\",\n" +
                    "                \"录入时间\": \"2014/12/29 14:16:00\",\n" +
                    "                \"是否提交\": \"0\",\n" +
                    "                \"workhours\": []\n" +
                    "            },\n" +
                    "            {\n" +
                    "                \"ID\": \"29\",\n" +
                    "                \"维修任务ID\": \"3\",\n" +
                    "                \"标题\": \"1\",\n" +
                    "                \"维修工作描述\": \"2\",\n" +
                    "                \"录入人员信息ID\": \"7\",\n" +
                    "                \"录入时间\": \"2014/12/29 14:16:00\",\n" +
                    "                \"是否提交\": \"0\",\n" +
                    "                \"workhours\": [\n" +
                    "                    {\n" +
                    "                        \"ID\": \"20\",\n" +
                    "                        \"维修过程ID\": \"29\",\n" +
                    "                        \"维修人员ID\": \"3\",\n" +
                    "                        \"开始时间\": \"2014/12/30 11:00:00\",\n" +
                    "                        \"结束时间\": \"2014/12/30 12:00:00\",\n" +
                    "                        \"工时\": \"1\",\n" +
                    "                        \"维修人员姓名\": \"handler1\"\n" +
                    "                    },\n" +
                    "                    {\n" +
                    "                        \"ID\": \"21\",\n" +
                    "                        \"维修过程ID\": \"29\",\n" +
                    "                        \"维修人员ID\": \"7\",\n" +
                    "                        \"开始时间\": \"2014/12/30 12:00:00\",\n" +
                    "                        \"结束时间\": \"2014/12/30 13:00:00\",\n" +
                    "                        \"工时\": \"1\",\n" +
                    "                        \"维修人员姓名\": \"lijm\"\n" +
                    "                    }\n" +
                    "                ]\n" +
                    "            },\n" +
                    "            {\n" +
                    "                \"ID\": \"30\",\n" +
                    "                \"维修任务ID\": \"3\",\n" +
                    "                \"标题\": \"1\",\n" +
                    "                \"维修工作描述\": \"2\",\n" +
                    "                \"录入人员信息ID\": \"7\",\n" +
                    "                \"录入时间\": \"2014/12/29 14:16:00\",\n" +
                    "                \"是否提交\": \"0\",\n" +
                    "                \"workhours\": [\n" +
                    "                    {\n" +
                    "                        \"ID\": \"22\",\n" +
                    "                        \"维修过程ID\": \"30\",\n" +
                    "                        \"维修人员ID\": \"3\",\n" +
                    "                        \"开始时间\": \"2014/12/30 11:00:00\",\n" +
                    "                        \"结束时间\": \"2014/12/30 12:00:00\",\n" +
                    "                        \"工时\": \"1\",\n" +
                    "                        \"维修人员姓名\": \"handler1\"\n" +
                    "                    },\n" +
                    "                    {\n" +
                    "                        \"ID\": \"23\",\n" +
                    "                        \"维修过程ID\": \"30\",\n" +
                    "                        \"维修人员ID\": \"7\",\n" +
                    "                        \"开始时间\": \"2014/12/30 12:00:00\",\n" +
                    "                        \"结束时间\": \"2014/12/30 13:00:00\",\n" +
                    "                        \"工时\": \"1\",\n" +
                    "                        \"维修人员姓名\": \"lijm\"\n" +
                    "                    }\n" +
                    "                ]\n" +
                    "            },\n" +
                    "            {\n" +
                    "                \"ID\": \"31\",\n" +
                    "                \"维修任务ID\": \"3\",\n" +
                    "                \"标题\": \"1\",\n" +
                    "                \"维修工作描述\": \"2\",\n" +
                    "                \"录入人员信息ID\": \"7\",\n" +
                    "                \"录入时间\": \"2014/12/29 14:16:00\",\n" +
                    "                \"是否提交\": \"0\",\n" +
                    "                \"workhours\": [\n" +
                    "                    {\n" +
                    "                        \"ID\": \"24\",\n" +
                    "                        \"维修过程ID\": \"31\",\n" +
                    "                        \"维修人员ID\": \"3\",\n" +
                    "                        \"开始时间\": \"2014/12/30 11:00:00\",\n" +
                    "                        \"结束时间\": \"2014/12/30 12:00:00\",\n" +
                    "                        \"工时\": \"1\",\n" +
                    "                        \"维修人员姓名\": \"handler1\"\n" +
                    "                    },\n" +
                    "                    {\n" +
                    "                        \"ID\": \"25\",\n" +
                    "                        \"维修过程ID\": \"31\",\n" +
                    "                        \"维修人员ID\": \"7\",\n" +
                    "                        \"开始时间\": \"2014/12/30 12:00:00\",\n" +
                    "                        \"结束时间\": \"2014/12/30 13:00:00\",\n" +
                    "                        \"工时\": \"1\",\n" +
                    "                        \"维修人员姓名\": \"lijm\"\n" +
                    "                    }\n" +
                    "                ]\n" +
                    "            },\n" +
                    "            {\n" +
                    "                \"ID\": \"32\",\n" +
                    "                \"维修任务ID\": \"3\",\n" +
                    "                \"标题\": \"1\",\n" +
                    "                \"维修工作描述\": \"2\",\n" +
                    "                \"录入人员信息ID\": \"7\",\n" +
                    "                \"录入时间\": \"2014/12/29 14:16:00\",\n" +
                    "                \"是否提交\": \"0\",\n" +
                    "                \"workhours\": [\n" +
                    "                    {\n" +
                    "                        \"ID\": \"26\",\n" +
                    "                        \"维修过程ID\": \"32\",\n" +
                    "                        \"维修人员ID\": \"3\",\n" +
                    "                        \"开始时间\": \"2014/12/30 11:00:00\",\n" +
                    "                        \"结束时间\": \"2014/12/30 12:00:00\",\n" +
                    "                        \"工时\": \"1\",\n" +
                    "                        \"维修人员姓名\": \"handler1\"\n" +
                    "                    },\n" +
                    "                    {\n" +
                    "                        \"ID\": \"27\",\n" +
                    "                        \"维修过程ID\": \"32\",\n" +
                    "                        \"维修人员ID\": \"7\",\n" +
                    "                        \"开始时间\": \"2014/12/30 12:00:00\",\n" +
                    "                        \"结束时间\": \"2014/12/30 13:00:00\",\n" +
                    "                        \"工时\": \"1\",\n" +
                    "                        \"维修人员姓名\": \"lijm\"\n" +
                    "                    }\n" +
                    "                ]\n" +
                    "            },\n" +
                    "            {\n" +
                    "                \"ID\": \"33\",\n" +
                    "                \"维修任务ID\": \"3\",\n" +
                    "                \"标题\": \"1\",\n" +
                    "                \"维修工作描述\": \"2\",\n" +
                    "                \"录入人员信息ID\": \"7\",\n" +
                    "                \"录入时间\": \"2014/12/29 14:16:00\",\n" +
                    "                \"是否提交\": \"0\",\n" +
                    "                \"workhours\": [\n" +
                    "                    {\n" +
                    "                        \"ID\": \"28\",\n" +
                    "                        \"维修过程ID\": \"33\",\n" +
                    "                        \"维修人员ID\": \"3\",\n" +
                    "                        \"开始时间\": \"2014/12/30 11:00:00\",\n" +
                    "                        \"结束时间\": \"2014/12/30 12:00:00\",\n" +
                    "                        \"工时\": \"1\",\n" +
                    "                        \"维修人员姓名\": \"handler1\"\n" +
                    "                    },\n" +
                    "                    {\n" +
                    "                        \"ID\": \"29\",\n" +
                    "                        \"维修过程ID\": \"33\",\n" +
                    "                        \"维修人员ID\": \"7\",\n" +
                    "                        \"开始时间\": \"2014/12/30 12:00:00\",\n" +
                    "                        \"结束时间\": \"2014/12/30 13:00:00\",\n" +
                    "                        \"工时\": \"1\",\n" +
                    "                        \"维修人员姓名\": \"lijm\"\n" +
                    "                    }\n" +
                    "                ]\n" +
                    "            },\n" +
                    "            {\n" +
                    "                \"ID\": \"34\",\n" +
                    "                \"维修任务ID\": \"3\",\n" +
                    "                \"标题\": \"1\",\n" +
                    "                \"维修工作描述\": \"2\",\n" +
                    "                \"录入人员信息ID\": \"7\",\n" +
                    "                \"录入时间\": \"2014/12/29 14:16:00\",\n" +
                    "                \"是否提交\": \"0\",\n" +
                    "                \"workhours\": [\n" +
                    "                    {\n" +
                    "                        \"ID\": \"30\",\n" +
                    "                        \"维修过程ID\": \"34\",\n" +
                    "                        \"维修人员ID\": \"3\",\n" +
                    "                        \"开始时间\": \"2014/12/30 11:00:00\",\n" +
                    "                        \"结束时间\": \"2014/12/30 12:00:00\",\n" +
                    "                        \"工时\": \"1\",\n" +
                    "                        \"维修人员姓名\": \"handler1\"\n" +
                    "                    },\n" +
                    "                    {\n" +
                    "                        \"ID\": \"31\",\n" +
                    "                        \"维修过程ID\": \"34\",\n" +
                    "                        \"维修人员ID\": \"7\",\n" +
                    "                        \"开始时间\": \"2014/12/30 12:00:00\",\n" +
                    "                        \"结束时间\": \"2014/12/30 13:00:00\",\n" +
                    "                        \"工时\": \"1\",\n" +
                    "                        \"维修人员姓名\": \"lijm\"\n" +
                    "                    }\n" +
                    "                ]\n" +
                    "            },\n" +
                    "            {\n" +
                    "                \"ID\": \"35\",\n" +
                    "                \"维修任务ID\": \"3\",\n" +
                    "                \"标题\": \"1\",\n" +
                    "                \"维修工作描述\": \"2\",\n" +
                    "                \"录入人员信息ID\": \"7\",\n" +
                    "                \"录入时间\": \"2014/12/29 14:16:00\",\n" +
                    "                \"是否提交\": \"0\",\n" +
                    "                \"workhours\": [\n" +
                    "                    {\n" +
                    "                        \"ID\": \"32\",\n" +
                    "                        \"维修过程ID\": \"35\",\n" +
                    "                        \"维修人员ID\": \"3\",\n" +
                    "                        \"开始时间\": \"2014/12/30 11:00:00\",\n" +
                    "                        \"结束时间\": \"2014/12/30 12:00:00\",\n" +
                    "                        \"工时\": \"1\",\n" +
                    "                        \"维修人员姓名\": \"handler1\"\n" +
                    "                    },\n" +
                    "                    {\n" +
                    "                        \"ID\": \"33\",\n" +
                    "                        \"维修过程ID\": \"35\",\n" +
                    "                        \"维修人员ID\": \"7\",\n" +
                    "                        \"开始时间\": \"2014/12/30 12:00:00\",\n" +
                    "                        \"结束时间\": \"2014/12/30 14:00:00\",\n" +
                    "                        \"工时\": \"2\",\n" +
                    "                        \"维修人员姓名\": \"lijm\"\n" +
                    "                    }\n" +
                    "                ]\n" +
                    "            }\n" +
                    "        ],\n" +
                    "        \"items\": [\n" +
                    "            {\n" +
                    "                \"部件ID\": \"\",\n" +
                    "                \"部件报修来源\": \"3\",\n" +
                    "                \"受理编号\": \"294301662101010001\",\n" +
                    "                \"故障内容\": \"建筑消防设施部件运行状态:001000017001001-电源故障\",\n" +
                    "                \"报修时间\": \"2010/12/8 8:42:18\",\n" +
                    "                \"结束时间\": \"\",\n" +
                    "                \"派单时间\": \"\",\n" +
                    "                \"维修状态\": \"1\",\n" +
                    "                \"系统名称\": \"气体灭火系统\",\n" +
                    "                \"单位名称\": \"公安部沈阳消防研究所\",\n" +
                    "                \"单位ID\": \"2101010001\",\n" +
                    "                \"中心ID\": \"35020301\",\n" +
                    "                \"维修任务ID\": \"3\",\n" +
                    "                \"ID\": \"5\",\n" +
                    "                \"维修部件ID\": \"9212\",\n" +
                    "                \"系统类型ID\": \"13\",\n" +
                    "                \"设备单项\": \"0\",\n" +
                    "                \"故障单项\": \"0\",\n" +
                    "                \"实际系统类型ID\": \"\",\n" +
                    "                \"实际设备单项\": \"\",\n" +
                    "                \"实际故障单项\": \"\",\n" +
                    "                \"维修措施\": \"\",\n" +
                    "                \"建筑物类型\": \"0\",\n" +
                    "                \"c企业编码\": \"\",\n" +
                    "                \"中心名称\": \"沈北新区监控中心\"\n" +
                    "            },\n" +
                    "            {\n" +
                    "                \"部件ID\": \"0\",\n" +
                    "                \"部件报修来源\": \"3\",\n" +
                    "                \"受理编号\": \"328666523502030001\",\n" +
                    "                \"故障内容\": \"建筑消防设施部件运行状态:001000002001016-故障\",\n" +
                    "                \"报修时间\": \"2011/1/21 8:39:08\",\n" +
                    "                \"结束时间\": \"\",\n" +
                    "                \"派单时间\": \"2011/1/16 12:25:51\",\n" +
                    "                \"维修状态\": \"2\",\n" +
                    "                \"系统名称\": \"火灾自动报警系统\",\n" +
                    "                \"单位名称\": \"沈阳消防研究所\",\n" +
                    "                \"单位ID\": \"3502030001\",\n" +
                    "                \"中心ID\": \"35020301\",\n" +
                    "                \"维修任务ID\": \"3\",\n" +
                    "                \"ID\": \"8\",\n" +
                    "                \"维修部件ID\": \"9214\",\n" +
                    "                \"系统类型ID\": \"1\",\n" +
                    "                \"设备单项\": \"0\",\n" +
                    "                \"故障单项\": \"0\",\n" +
                    "                \"实际系统类型ID\": \"-1\",\n" +
                    "                \"实际设备单项\": \"-1\",\n" +
                    "                \"实际故障单项\": \"-1\",\n" +
                    "                \"维修措施\": \"\",\n" +
                    "                \"建筑物类型\": \"0\",\n" +
                    "                \"c企业编码\": \"\",\n" +
                    "                \"中心名称\": \"沈北新区监控中心\"\n" +
                    "            }\n" +
                    "        ],\n" +
                    "        \"wokers\": [\n" +
                    "            {\n" +
                    "                \"ID\": \"1\",\n" +
                    "                \"维修任务ID\": \"3\",\n" +
                    "                \"维修人员ID\": \"7\",\n" +
                    "                \"真实姓名\": \"lijm\"\n" +
                    "            },\n" +
                    "            {\n" +
                    "                \"ID\": \"2\",\n" +
                    "                \"维修任务ID\": \"3\",\n" +
                    "                \"维修人员ID\": \"10\",\n" +
                    "                \"真实姓名\": \"yandf\"\n" +
                    "            }\n" +
                    "        ]\n" +
                    "    }\n" +
                    "}";
            response = new Response(body);
        }
        return response;
    }
}
